# Manejo de archivos con Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
poblacion_dict = {'Campeche': 2846722, 
                  'Tlaxcala': 1340595, 
                  'Nuevo Leon': 7347743, 
                  'Guanajuato': 4344223, 
                  'Hidalgo': 3945873} 
poblacion = pd.Series(poblacion_dict)
poblacion

Campeche      2846722
Tlaxcala      1340595
Nuevo Leon    7347743
Guanajuato    4344223
Hidalgo       3945873
dtype: int64

In [3]:
area_dict = {'Campeche': 349533, 
             'Tlaxcala': 73043, 
             'Nuevo Leon':367895, 
             #'Guanajuato': 100122, 
             'Hidalgo': 983453,
              'Michoacan': 2121211
            } 
area = pd.Series(area_dict) 
area

Campeche       349533
Tlaxcala        73043
Nuevo Leon     367895
Hidalgo        983453
Michoacan     2121211
dtype: int64

In [4]:
seguridad_dict = {'Campeche': 2, 
             'Tlaxcala': 10, 
             'Nuevo Leon':25, 
             'Guanajuato': 30, 
             'Hidalgo': 13,
              'Michoacan': 31
            } 
seguridad = pd.Series(seguridad_dict) 
seguridad

Campeche       2
Tlaxcala      10
Nuevo Leon    25
Guanajuato    30
Hidalgo       13
Michoacan     31
dtype: int64

In [5]:
estados = pd.DataFrame({'poblacion': poblacion, 
                        'area': area,
                        'seguridad': seguridad
                       }) 
estados

            poblacion       area  seguridad
Campeche    2846722.0   349533.0          2
Guanajuato  4344223.0        NaN         30
Hidalgo     3945873.0   983453.0         13
Michoacan         NaN  2121211.0         31
Nuevo Leon  7347743.0   367895.0         25
Tlaxcala    1340595.0    73043.0         10

In [6]:
estados.index

Index(['Campeche', 'Guanajuato', 'Hidalgo', 'Michoacan', 'Nuevo Leon',
       'Tlaxcala'],
      dtype='object')

In [7]:
estados.columns

Index(['poblacion', 'area', 'seguridad'], dtype='object')

In [8]:
estados.values

array([[2.846722e+06, 3.495330e+05, 2.000000e+00],
       [4.344223e+06,          nan, 3.000000e+01],
       [3.945873e+06, 9.834530e+05, 1.300000e+01],
       [         nan, 2.121211e+06, 3.100000e+01],
       [7.347743e+06, 3.678950e+05, 2.500000e+01],
       [1.340595e+06, 7.304300e+04, 1.000000e+01]])

In [7]:
estados.isnull()

            poblacion   area  seguridad
Campeche        False  False      False
Guanajuato      False   True      False
Hidalgo         False  False      False
Michoacan        True  False      False
Nuevo Leon      False  False      False
Tlaxcala        False  False      False

In [10]:
estados.notnull()

            poblacion   area  seguridad
Campeche         True   True       True
Guanajuato       True  False       True
Hidalgo          True   True       True
Michoacan       False   True       True
Nuevo Leon       True   True       True
Tlaxcala         True   True       True

In [8]:
estados.dropna()

            poblacion      area  seguridad
Campeche    2846722.0  349533.0          2
Hidalgo     3945873.0  983453.0         13
Nuevo Leon  7347743.0  367895.0         25
Tlaxcala    1340595.0   73043.0         10

In [9]:
estados.dropna(axis='columns')

            seguridad
Campeche            2
Guanajuato         30
Hidalgo            13
Michoacan          31
Nuevo Leon         25
Tlaxcala           10

In [10]:
estados.dropna(axis=1, how='all')

            poblacion       area  seguridad
Campeche    2846722.0   349533.0          2
Guanajuato  4344223.0        NaN         30
Hidalgo     3945873.0   983453.0         13
Michoacan         NaN  2121211.0         31
Nuevo Leon  7347743.0   367895.0         25
Tlaxcala    1340595.0    73043.0         10

In [12]:
estados['ColumnaNueva'] = pd.Series([], dtype=object)
estados

            poblacion       area  seguridad ColumnaNueva
Campeche    2846722.0   349533.0          2          NaN
Guanajuato  4344223.0        NaN         30          NaN
Hidalgo     3945873.0   983453.0         13          NaN
Michoacan         NaN  2121211.0         31          NaN
Nuevo Leon  7347743.0   367895.0         25          NaN
Tlaxcala    1340595.0    73043.0         10          NaN

In [14]:
#estados
estados.dropna(axis=1, how='any') #any

            seguridad
Campeche            2
Guanajuato         30
Hidalgo            13
Michoacan          31
Nuevo Leon         25
Tlaxcala           10

In [20]:
#estados
estados.dropna(axis='rows' , thresh=3)

            poblacion      area  seguridad ColumnaNueva
Campeche    2846722.0  349533.0          2          NaN
Hidalgo     3945873.0  983453.0         13          NaN
Nuevo Leon  7347743.0  367895.0         25          NaN
Tlaxcala    1340595.0   73043.0         10          NaN

In [22]:
estados.fillna(1000)

            poblacion       area  seguridad  ColumnaNueva
Campeche    2846722.0   349533.0          2          1000
Guanajuato  4344223.0     1000.0         30          1000
Hidalgo     3945873.0   983453.0         13          1000
Michoacan      1000.0  2121211.0         31          1000
Nuevo Leon  7347743.0   367895.0         25          1000
Tlaxcala    1340595.0    73043.0         10          1000

In [23]:
estados.mean(axis=0)

poblacion       3965031.2
area             779027.0
seguridad            18.5
ColumnaNueva          NaN
dtype: float64

In [19]:
estados.sum()

poblacion       19825156.0
area             3895135.0
seguridad            111.0
ColumnaNueva           0.0
dtype: float64

In [24]:
estados.mean(axis=1)

Campeche      1.065419e+06
Guanajuato    2.172126e+06
Hidalgo       1.643113e+06
Michoacan     1.060621e+06
Nuevo Leon    2.571888e+06
Tlaxcala      4.712160e+05
dtype: float64

In [21]:
estados.sum(axis='columns')

Campeche      3196257.0
Guanajuato    4344253.0
Hidalgo       4929339.0
Michoacan     2121242.0
Nuevo Leon    7715663.0
Tlaxcala      1413648.0
dtype: float64

In [22]:
# pip install seaborn
import seaborn as sns 
planets = sns.load_dataset('planets') 
planets.shape

(1035, 6)

In [23]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [24]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [25]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

# Leyendo archivos

In [27]:
iris = pd.read_csv('data/Iris.csv')
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [28]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [29]:
iris.to_json('data/iris.json')

In [31]:
#pip install openpyxl
iris.to_excel("data/iris.xlsx", sheet_name="IrisData")

# Ejercicio

In [30]:
data = pd.read_csv('data/heights.csv') 
heights = np.array(data['height']) 
print(heights)

[189 170 189 163 183 171 185 168 173 183 173 173 175 178 183 193 178 173
 174 183 183 168 170 178 182 180 183 178 182 188 175 179 183 193 182 183
 177 185 188 188 182 185]

In [31]:
data

    order                    name  height
0       1       George Washington     189
1       2              John Adams     170
2       3        Thomas Jefferson     189
3       4           James Madison     163
4       5            James Monroe     183
5       6       John Quincy Adams     171
6       7          Andrew Jackson     185
7       8        Martin Van Buren     168
8       9  William Henry Harrison     173
9      10              John Tyler     183
10     11           James K. Polk     173
11     12          Zachary Taylor     173
12     13        Millard Fillmore     175
13     14         Franklin Pierce     178
14     15          James Buchanan     183
15     16         Abraham Lincoln     193
16     17          Andrew Johnson     178
17     18        Ulysses S. Grant     173
18     19     Rutherford B. Hayes     174
19     20       James A. Garfield     183
20     21       Chester A. Arthur     183
21     23       Benjamin Harrison     168
22     25        William McKinley     170
23     26      Theodore Roosevelt     178
24     27     William Howard Taft     182
25     28          Woodrow Wilson     180
26     29       Warren G. Harding     183
27     30         Calvin Coolidge     178
28     31          Herbert Hoover     182
29     32   Franklin D. Roosevelt     188
30     33         Harry S. Truman     175
31     34    Dwight D. Eisenhower     179
32     35         John F. Kennedy     183
33     36       Lyndon B. Johnson     193
34     37           Richard Nixon     182
35     38             Gerald Ford     183
36     39            Jimmy Carter     177
37     40           Ronald Reagan     185
38     41       George H. W. Bush     188
39     42            Bill Clinton     188
40     43          George W. Bush     182
41     44            Barack Obama     185

In [33]:
# ALtura promedio de los presidentes e USA

data["height"].mean()

179.73809523809524

In [34]:
# Presidente mas alto
data.height.max()

193

In [ ]:
#Presidente mas chaparro

In [13]:
# Describir las altuars de los presidentes

In [35]:
data.loc[(data.height < 170) | (data.height > 190)]

    order               name  height
3       4      James Madison     163
7       8   Martin Van Buren     168
15     16    Abraham Lincoln     193
21     23  Benjamin Harrison     168
33     36  Lyndon B. Johnson     193